//
//  ConstitutionStrings.swift
//  DiscordStackViewSample
//
//  Created by Yamada Shunya on 2019/08/27.
//  Copyright © 2019 Yamada Shunya. All rights reserved.
//

import Foundation

struct ConstitutionStrings {
    
    private static let dict: [String: String] = [
        "『人的資源(アジテートハレーション)』プロジェクト": """
        計画したのは統括理事会の一人である薬味久子。
        駒場利徳らを使った予備実験（SS1巻）、新入生を使った第一次実験（新約1巻）、
        垣根帝督を使った第二次実験（新約5～6巻）を経た後、実行された。
        
        学園都市上層部にとっての不確定要素であるヒーロー達を最小の犠牲で、かつ迅速に共倒れさせる計画。
        ヒーローの要素を持つ者が「庇護対象」の危機に反応する性質を利用しており、作中で行われた際の庇護対象はフレメア＝セイヴェルンに設定されている。
        AIM拡散力場を介して精神に干渉されると、フレメアとの面識の有無や物理的な距離に関係なく、
        彼女が「助けて」と思えば天啓を得たようにその悲鳴がヒーロー達に伝わる。
        これを受けたヒーロー達は極端に攻撃的、独善的になり「自分以外の方法では彼女を救えないから他はすべて敵」と認識し、別のヒーローや一般人にすらも攻撃を加える。
        さらに、ヒーロー同士だけでなく一般人にも攻撃的になり、「正義である自分に協力しない者は悪」と断じ、犯罪行為も厭わなくなってしまう。
        
        一緒に居る状態なら幻想殺しを有する上条にも普通に影響を及ぼす。
        強固なパーソナリティを持ちAIM拡散力場への干渉を力づくで断ち切ることができた超能力者には影響が出ず、それぞれが自由意志で避雷針に集結し、多数のヒーロー達と激突した。
        
        上述の効果は副産的なものであり、
        真の目的は薬味久子の意識をAIM拡散力場を媒体とする濃淡コンピュータに移すこと。
        ヒーロー達を潰し合わせるという建前は他の統括理事会のメンバーが承認しない為。
        
        庇護対象としての機能しか想定されていなかったフレメアにヒーローの要素が発動するとは予想されていなかったため、
        その齟齬をきっかけにプロジェクトは崩壊、終息した。
        """,
        "金崎大学付属・筋ジストロフィー研究センター(かなさきだいがくふぞく・―)": """
        表向きは筋ジストロフィーの研究施設。
        実際は絶対能力進化実験に関係する施設だった為に、
        御坂美琴の力によりネットを介し機材を破壊され、研究から撤退している。
        """,
        "青キ木ノ札ヲ用イ我ガ身ヲ守レ(デクのボウどもせめてタテとしてヤクにタて)": """
        土御門が使用した防御魔術。
        アビニョンを侵攻するHsPS-15が装備していた対隔壁用ショットガンの弾丸を防御するために発動。
        折り紙を取り出して呪文を叫び、
        彼を狙って撃ち出された十数発の対物弾を着弾手前で盾で弾く様に周囲へ散らしてみせた。
        """,
        "常盤台中学内伝　おばーちゃん式ナナメ四五度からの打撃による故障機械再生法": """
        １：金が飲み込まれる自動販売機の前に立つ。
        ２：技名を叫びながら自販機の側面に45°の角度で蹴りを入れる。
        ３：すると無料でジュースを入手する事ができる。
        ※なお、ジュースの種別を指定する事はできない。
        
        「故障機械再生法」と謳われているが実際故障したのはこれが原因かもしれない。
        話中、この技を美琴が使用する度に清掃ロボットが出動する。
        
        「常盤台中学内伝」と書かれているものの、使い手は美琴以外確認されていない。
        超電磁砲第三十二話によると、新入生の時この自販機に万札を飲まれた過去があり、それゆえの犯行の模様。
        なので、実際の使い手は美琴一人の可能性も。
        黒子は美琴がこの技でジュースを失敬しているのを知っているが、上記の事情を知っている為か黙認している。
        
        とある魔術の禁書目録 PSPゲーム版では美琴の技の一つとして入っている。
        """,
        "竜王の殺息(ドラゴンブレス)": """
        『聖ジョージの聖域』で発生した空間の亀裂から放たれる、直径数mもの光の柱。
        最大射程は不明だが、衛星軌道上のおりひめ一号を破壊したことから最低でも宇宙までは優に届く。
        魔法陣が織りなす亀裂の奥には『何か』が覗きこんでおり、わずかに獣のような匂いがする。
        神裂曰く、「伝説にある聖ジョージのドラゴンの一撃と同義」であるらしい。
        
        その破壊力は並の物なら灰も残さず消滅させ、歩く教会の絶対防御をも貫通してしまう程で、
        対異能にはほぼ無敵の『幻想殺し』にすら物量作戦で押し勝ってしまう等、
        魔術の中でも性能が一段飛びぬけている。
        (正確には異能の消去自体はできているが、一つならともかく、
        「光の粒子は一つ一つの『質』がバラバラで、幻想殺しの処理が追いつかない」らしい。)
        
        この術式で破壊された物質は、人体を酷く傷つける無数の『光の羽』と化す。
        実際に『光の羽』を頭に受けた上条は頭部と脳細胞に酷い損傷を受け、記憶を失った。
        更に、対十字教用追加魔術として『神よ、何故私を見捨てたのですか』が存在する。
        
        弱点は発射口である魔法陣と軌道が連動しており、術者の足場を崩されると狙いがずれてしまう点。
        後に明らかになったが、足元を破壊されて上を向いた際に、
        樹形図の設計者を搭載した人工衛星を破壊している。
        
        とある魔術の電脳戦機(ゲーム版)で禁書目録が駆るバル・ルルーンのVW(必殺技)は、この『羽』に酷似している。
        特に自動書記状態にあるわけでもないのでイメージ上のものか。
        """,
        "水よ、蛇となりて剣のように突き刺せ(メム＝テト＝ラメド＝ザイン)": """
        ミーシャ＝クロイツェフが、
        上条当麻の幻想殺しの効果を確かめるために発動させた魔術。
        水を呼び出して、その水をヒュドラやヤマタノオロチの如き姿をした「水の蛇」へと変えて、槍のように突き刺す。
        呪文は以下の通り。

        数価。　四〇・九・三〇・七。合わせて八十六
        メム＝テト＝ラメド＝ザイン
        照応。水よ、蛇となりて剣のように突き刺せ
        """
    ]
    
    static func dictionary() -> (key: String, value: String) {
        return dict.shuffled().first!
    }
    
    static func short() -> String {
        return """
        日本国民は、正当に選挙された国会における代表者を通じて行動し、われらとわれらの子孫のために、諸国民との協和による成果と、わが国全土にわたつて自由のもたらす恵沢を確保し、政府の行為によつて再び戦争の惨禍が起ることのないやうにすることを決意し、ここに主権が国民に存することを宣言し、この憲法を確定する。そもそも国政は、国民の厳粛な信託によるものであつて、その権威は国民に由来し、その権力は国民の代表者がこれを行使し、その福利は国民がこれを享受する。これは人類普遍の原理であり、この憲法は、かかる原理に基くものである。
        """
    }
    
    static func long() -> String {
        return """
        天皇の地位と主権在民〕
        
        第一条　天皇は、日本国の象徴であり日本国民統合の象徴であつて、この地位は、主権の存する日本国民の総意に基く。
        
        〔皇位の世襲〕
        
        第二条　皇位は、世襲のものであつて、国会の議決した皇室典範の定めるところにより、これを継承する。
        
        〔内閣の助言と承認及び責任〕
        
        第三条　天皇の国事に関するすべての行為には、内閣の助言と承認を必要とし、内閣が、その責任を負ふ。
        
        〔天皇の権能と権能行使の委任〕
        
        第四条　天皇は、この憲法の定める国事に関する行為のみを行ひ、国政に関する権能を有しない。
        
        ２　天皇は、法律の定めるところにより、その国事に関する行為を委任することができる。
        
        〔摂政〕
        
        第五条　皇室典範の定めるところにより摂政を置くときは、摂政は、天皇の名でその国事に関する行為を行ふ。この場合には、前条第一項の規定を準用する。
        
        〔天皇の任命行為〕
        
        第六条　天皇は、国会の指名に基いて、内閣総理大臣を任命する。
        
        ２　天皇は、内閣の指名に基いて、最高裁判所の長たる裁判官を任命する。
        
        〔天皇の国事行為〕
        
        第七条　天皇は、内閣の助言と承認により、国民のために、左の国事に関する行為を行ふ。
        一　憲法改正、法律、政令及び条約を公布すること。
        
        二　国会を召集すること。
        
        三　衆議院を解散すること。
        
        四　国会議員の総選挙の施行を公示すること。
        
        五　国務大臣及び法律の定めるその他の官吏の任免並びに全権委任状及び大使及び公使の信任状を認証すること。
        
        六　大赦、特赦、減刑、刑の執行の免除及び復権を認証すること。
        
        七　栄典を授与すること。
        
        八　批准書及び法律の定めるその他の外交文書を認証すること。
        
        九　外国の大使及び公使を接受すること。
        
        十　儀式を行ふこと。
        
        〔財産授受の制限〕
        
        第八条　皇室に財産を譲り渡し、又は皇室が、財産を譲り受け、若しくは賜与することは、国会の議決に基かなければならない。
        """
    }
}
